src/DataProcessors/МодульОбменаЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>МодульОбменаЕГАИС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>Заказы поставщикам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРег</Name>
					<Comment>Сумма заказанной номенклатуры рег.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/СоответствиеНоменклатурыЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеНоменклатурыЕГАИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АлкогольнаяПродукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/КлассификаторОрганизацийЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>КлассификаторОрганизацийЕГАИС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтраны</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеАдреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТС</Name>
					<Comment>Номер таможенного союза</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтоматическоеПеремещениеВТЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИспользоватьПартионныйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКраткое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/МодульОбменаЕГАИС/Forms/ФормаСопоставленияПоЗаказам/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПроверитьСопоставление()
	
	Для Каждого ТекущаяСтрока Из ТаблицаТТН Цикл
		ТекущаяСтрока.Сопоставлена = Ложь;
	КонецЦикла;
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.Сопоставлена = Ложь;
			Продолжить;
		КонецЕсли;
		
		ТекущаяСтрока.Сопоставлена = Истина;
		
		МассивСтрок = ТаблицаТТН.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		Для Каждого СопоставленнаяСтрока Из МассивСтрок Цикл
			СопоставленнаяСтрока.Сопоставлена = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФильтрЗаказов()
	
	ОтборСтрок = Новый ФиксированнаяСтруктура("ПодразделениеКомпании", ТекущееПодразделение);

	Если ВсеПодразделения Тогда
		Элементы.ЗаказыПоставщику.ОтборСтрок = Неопределено;
	Иначе
		Элементы.ЗаказыПоставщику.ОтборСтрок = ОтборСтрок;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Номер КАК Номер,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Дата КАК Дата,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗаказыПоставщикамОстатки.ЗаказПоставщику.Комментарий КАК Комментарий
	|ИЗ
	|	РегистрНакопления.ЗаказыПоставщикам.Остатки(,
	|	Контрагент = &Контрагент" + ?(ОтборПоВидуАП, " И (НЕ Номенклатура.ВидАлкогольнойПродукции = ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка))", "") + ") КАК ЗаказыПоставщикамОстатки
	|ГДЕ
	|	ЗаказыПоставщикамОстатки.ЗаказаноОстаток > 0
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТТН",        ТоварноТранспортнаяНакладная);
	//Если Не ДокументОбъект.Ссылка.Пустая() Тогда
	//	Запрос.УстановитьПараметр("Момент", ДокументОбъект.Ссылка.МоментВремени());
	//КонецЕсли;
	ЗаказыПоставщику.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЗаказыПоставщику.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ТоварноТранспортнаяНакладная = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ТоварноТранспортнаяНакладная", Неопределено);
	Если ТоварноТранспортнаяНакладная = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТТН", ТоварноТранспортнаяНакладная);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Грузоотправитель КАК Грузоотправитель,
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Грузоотправитель.ИНН КАК ГрузоотправительИНН,
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Грузоотправитель.КПП КАК ГрузоотправительКПП,
	|	ТоварноТранспортнаяНакладнаяЕГАИС.ПодразделениеКомпании КАК ПодразделениеКомпании
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС КАК ТоварноТранспортнаяНакладнаяЕГАИС
	|ГДЕ
	|	ТоварноТранспортнаяНакладнаяЕГАИС.Ссылка = &ТТН
	|";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Контрагент = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКонтрагента(Выборка.ГрузоотправительИНН, Выборка.ГрузоотправительКПП, Выборка.Грузоотправитель);
		ТекущееПодразделение = ТоварноТранспортнаяНакладная.ПодразделениеКомпании;
	Иначе
		Контрагент = Неопределено;
	КонецЕсли;
	
	ОтборПоВидуАП = Истина;
	
	ОбновитьТаблицуЗаказов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.АлкогольнаяПродукция.Наименование КАК АлкогольнаяПродукцияНаименование,
	|	ТаблицаТовары.Справка1 КАК Справка1,
	|	ТаблицаТовары.Справка2 КАК Справка2,
	|	ТаблицаТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА (НЕ СоответствиеНоменклатурыЕГАИС.Номенклатура.КоличествоВМультипаке = 0) И (НЕ СоответствиеНоменклатурыЕГАИС.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL) ТОГДА
	|			ТаблицаТовары.Количество/СоответствиеНоменклатурыЕГАИС.Номенклатура.КоличествоВМультипаке
	|		КОГДА ТаблицаТовары.АлкогольнаяПродукция.Упакована ТОГДА
	|			ТаблицаТовары.Количество
	|		ИНАЧЕ
	|			ТаблицаТовары.Количество*10
	|	КОНЕЦ КАК Количество,
	|	ТаблицаТовары.Цена КАК Цена,
	|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура
	|ИЗ
	|	Документ.ТоварноТранспортнаяНакладнаяВходящаяЕГАИС.Товары КАК ТаблицаТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ПО
	|	ТаблицаТовары.АлкогольнаяПродукция = СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	АлкогольнаяПродукцияНаименование
	|ИТОГИ
	|	МАКСИМУМ(АлкогольнаяПродукцияНаименование),
	|	МАКСИМУМ(АлкогольнаяПродукция),
	|	МАКСИМУМ(Справка1),
	|	МАКСИМУМ(Справка2),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(Цена)
	|ПО
	|	ТаблицаТовары.ИдентификаторСтроки
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ТоварноТранспортнаяНакладная);
	
	НоменклатураИзСопоставления.Очистить();
	
	ВыборкаАП = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАП.Следующий() Цикл
		НоваяСтрока = ТаблицаТТН.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаАП);
		Номенклатура = НоваяСтрока.Номенклатура;
		Выборка = ВыборкаАП.Выбрать();
		Пока Выборка.Следующий() Цикл
			Номенклатура.Добавить(Выборка.Номенклатура);
			НоменклатураИзСопоставления.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЦикла;
	
	// Условное оформление товаров заказа
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЗаказа.Имя);
	
	ОтборЭлемента = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.Использование  = Истина;
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваровЗаказа.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НоменклатураИзСопоставления;
	
	НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 0));
	
	// Условное оформление подобранных товаров
	НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваров.Имя);
	
	ОтборЭлемента = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.Использование  = Истина;
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = НоменклатураИзСопоставления;
	
	НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 0));
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Сопоставлена", Истина);
	
	Элементы.СопоставленнаяТаблицаТоваров.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
	ОбновитьФильтрЗаказов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ПроверитьСопоставление();
	ОтображатьСопоставленныеПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ТаблицаТоваров.ТекущиеДанные = Неопределено Тогда
		ТекущийИдентификатор = "";
	Иначе
		ТекущийИдентификатор = Элементы.ТаблицаТоваров.ТекущиеДанные.ИдентификаторСтроки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСопоставленныеПриИзменении(Элемент = Неопределено)
	
	Если ОтображатьСопоставленные Тогда
		
		Элементы.ТаблицаТоваров.ОтборСтрок = Неопределено;
		Элементы.ТаблицаТТН.ОтборСтрок     = Неопределено;
		Элементы.ТаблицаТТН1.ОтборСтрок    = Неопределено;
		
	Иначе
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Сопоставлена", Ложь);
		
		Элементы.ТаблицаТТН1.ОтборСтрок    = Новый ФиксированнаяСтруктура(ОтборСтрок);
		Элементы.ТаблицаТТН.ОтборСтрок     = Новый ФиксированнаяСтруктура(ОтборСтрок);
		Элементы.ТаблицаТоваров.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВидуАППриИзменении(Элемент)
	
	ОбновитьТаблицуЗаказов();

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТТННачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Структура = Новый Структура;
	Структура.Вставить("ИдентификаторСтроки",  ТекущиеДанные.ИдентификаторСтроки);
	Структура.Вставить("АлкогольнаяПродукция", ТекущиеДанные.АлкогольнаяПродукция);
	Структура.Вставить("Количество",           ТекущиеДанные.Количество);
	Структура.Вставить("ТекущаяСтрока",        Элемент.ТекущаяСтрока);
	
	ПараметрыПеретаскивания.Значение = Структура;
	ПараметрыПеретаскивания.ДопустимыеДействия = ДопустимыеДействияПеретаскивания.Копирование;
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	ПараметрыПеретаскивания.Действие = ДействиеПеретаскивания.Копирование;
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПараметрыПеретаскивания.Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = ТаблицаТоваров.НайтиПоИдентификатору(Строка);
	
	СтрокаИсточник = ПараметрыПеретаскивания.Значение;
	
	СтрокаТТН = ТаблицаТТН.НайтиПоИдентификатору(СтрокаИсточник.ТекущаяСтрока);
	
	Если ТекущиеДанные.Количество > СтрокаИсточник.Количество Тогда
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущиеДанные);
		НоваяСтрока.Количество     = ТекущиеДанные.Количество - СтрокаИсточник.Количество;
		//Если НоваяСтрока.КоэффициентАлкогольнойПродукции = 0 Тогда
		//	НоваяСтрока.КоличествоПоНакладной = НоваяСтрока.Количество;
		//Иначе
		//	НоваяСтрока.КоличествоПоНакладной = Окр(НоваяСтрока.Количество/НоваяСтрока.КоэффициентАлкогольнойПродукции, 3);
		//КонецЕсли;
		НоваяСтрока.СтрокаРодителя = ТекущиеДанные.НомерСтроки;
	КонецЕсли;
	
	Если ТекущиеДанные.Количество < СтрокаТТН.Количество Тогда
		ДопСтрока = ТаблицаТТН.Добавить();
		ЗаполнитьЗначенияСвойств(ДопСтрока, СтрокаТТН);
		ДопСтрока.Количество     = СтрокаТТН.Количество-ТекущиеДанные.Количество;
		СтрокаТТН.Количество     = ТекущиеДанные.Количество;
	КонецЕсли;
	
	СтрокаТТН.Сопоставлена = Истина;
	СтрокаТТН.ЗаказПоставщику = ТекущиеДанные.ЗаказПоставщику;
	
	ТекущиеДанные.ИдентификаторСтроки  = СтрокаИсточник.ИдентификаторСтроки;
	ТекущиеДанные.АлкогольнаяПродукция = СтрокаИсточник.АлкогольнаяПродукция;
	ТекущиеДанные.Сопоставлена = Истина;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВсеПодразделенияПриИзменении(Элемент)
	
	ОбновитьФильтрЗаказов();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Результат = Ложь;
	Для Каждого ТекСтрока Из ЗаказыПоставщику Цикл
		Если ТекСтрока.Пометка = Истина Тогда
			Результат = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбран ни один заказ поставщику'"));
		Возврат;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из ТаблицаТТН Цикл
		Если НЕ ТекСтрока.Сопоставлена Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не все товары сопоставлены'"));
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ Результат Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Основание", ТоварноТранспортнаяНакладная);
	ПараметрыОткрытия.Вставить("ТаблицаСопоставления", ТаблицаТоваров);
	ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Основание", ТоварноТранспортнаяНакладная);
	ОткрытьФорму("Документ.ПоступлениеТоваров.ФормаОбъекта", ПараметрыОткрытия, ЭтотОбъект);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваровЗаказаНаСервере()
	
	ТекущаяСтрока = Элементы.ЗаказыПоставщику.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ЗаказыПоставщику.НайтиПоИдентификатору(ТекущаяСтрока);
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.НомерСтроки,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказПоставщикуТовары.Количество*ЗаказПоставщикуТовары.Коэффициент КАК Количество,
	|	ЗаказПоставщикуТовары.Цена
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование
	|";
	
	ТаблицаТоваровЗаказа.Очистить();
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.ЗаказПоставщику);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаТоваровЗаказа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицуТоваровЗаказа()
	
	ЗаполнитьТаблицуТоваровЗаказаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикуПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ЗаполнитьТаблицуТоваровЗаказа", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуТоваров()
	
	ТекущаяСтрока = Элементы.ЗаказыПоставщику.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ЗаказыПоставщику.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ЗаказПоставщикуТовары.Ссылка КАК ЗаказПоставщику,
	|	МАКСИМУМ(ЗаказПоставщикуТовары.Цена) КАК Цена,
	//|	МАКСИМУМ(ВЫБОР
	//|		КОГДА (НЕ ЗаказПоставщикуТовары.Номенклатура.КоличествоВМультипаке = 0) И (НЕ ЗаказПоставщикуТовары.Номенклатура.КоличествоВМультипаке ЕСТЬ NULL) ТОГДА
	//|			ЗаказПоставщикуТовары.Количество*ЗаказПоставщикуТовары.Номенклатура.КоличествоВМультипаке
	//|		КОГДА СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция ЕСТЬ NULL ИЛИ СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.Упакована ТОГДА
	//|			ЗаказПоставщикуТовары.Количество
	//|		ИНАЧЕ
	//|			ЗаказПоставщикуТовары.Количество*0.1
	//|	КОНЕЦ*ЗаказПоставщикуТовары.Коэффициент) КАК Количество,
	//|	МАКСИМУМ(ЗаказПоставщикуТовары.Количество*ЗаказПоставщикуТовары.Коэффициент) КАК КоличествоПоНакладной
	|	МАКСИМУМ(ЗаказПоставщикуТовары.Количество*ЗаказПоставщикуТовары.Коэффициент) КАК Количество
	|ИЗ
	|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ПО
	|	ЗаказПоставщикуТовары.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	|ГДЕ
	|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПоставщикуТовары.Ссылка,
	|	ЗаказПоставщикуТовары.Номенклатура,
	|	ЗаказПоставщикуТовары.НомерСтроки
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ТекущиеДанные.ЗаказПоставщику);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		СопоставитьСтроку(НоваяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикуПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ЗаказыПоставщику.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Пометка Тогда
		ЗаполнитьТаблицуТоваров();
	Иначе
		НайденныеСтроки = ТаблицаТоваров.НайтиСтроки(Новый Структура("ЗаказПоставщику", ТекущиеДанные.ЗаказПоставщику));
		Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			Если ТекущаяСтрока.Сопоставлена Тогда
				СтрокиТТН = ТаблицаТТН.НайтиСтроки(Новый Структура("ИдентификаторСтроки, ЗаказПоставщику", ТекущаяСтрока.ИдентификаторСтроки, ТекущаяСтрока.ЗаказПоставщику));
				Для Каждого СтрокаТТН Из СтрокиТТН Цикл
					СтрокаТТН.Сопоставлена    = Ложь;
					СтрокаТТН.ЗаказПоставщику = Неопределено;
				КонецЦикла;
				
				СтрокиТТН = ТаблицаТТН.НайтиСтроки(Новый Структура("ИдентификаторСтроки, Справка2, Сопоставлена", ТекущаяСтрока.ИдентификаторСтроки, ТекущаяСтрока.Справка2, Ложь));
				ТекущийИндекс = СтрокиТТН.Количество()-1;
				СводноеКоличество = 0;
				Пока ТекущийИндекс>0 Цикл
					СтрокаТТН = ТаблицаТТН[ТекущийИндекс];
					СводноеКоличество = СводноеКоличество + СтрокаТТН.Количество;
					ТаблицаТТН.Удалить(СтрокаТТН);
					ТекущийИндекс = ТекущийИндекс - 1;
				КонецЦикла;
				
				Если СводноеКоличество>0 Тогда
					СтрокаТТН = ТаблицаТТН[ТекущийИндекс];
					СтрокаТТН.Количество = СтрокаТТН.Количество + СводноеКоличество;
				КонецЕсли;
			КонецЕсли;
			
			ТаблицаТоваров.Удалить(ТекущаяСтрока);
		КонецЦикла;
		
		//СтрокаТТН.Свернуть("АлкогольнаяПродукция, Справка1, Справка2, Цена, ИдентификаторСтроки", "Количество");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьСтроку(ТекущаяСтрока)
	
	Если НоменклатураИзСопоставления.НайтиПоЗначению(ТекущаяСтрока.Номенклатура) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоСопоставлено = ТекущаяСтрока.Количество;
	
	Для Каждого СтрокаТТН Из ТаблицаТТН Цикл
		
		Если КоличествоСопоставлено = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Если СтрокаТТН.Сопоставлена Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТТН.Номенклатура.Количество() = 1 И СтрокаТТН.Номенклатура[0].Значение = ТекущаяСтрока.Номенклатура Тогда
			
			Если КоличествоСопоставлено > СтрокаТТН.Количество Тогда
				ДопСтрока = ТаблицаТоваров.Добавить();
				ЗаполнитьЗначенияСвойств(ДопСтрока, ТекущаяСтрока);
				ДопСтрока.Количество     = КоличествоСопоставлено - СтрокаТТН.Количество;
				//Если ДопСтрока.КоэффициентАлкогольнойПродукции = 0 Тогда
				//	ДопСтрока.КоличествоПоНакладной = ДопСтрока.Количество;
				//Иначе
				//	ДопСтрока.КоличествоПоНакладной = Окр(ДопСтрока.Количество/ДопСтрока.КоэффициентАлкогольнойПродукции, 3);
				//КонецЕсли;
				ДопСтрока.СтрокаРодителя = ТекущаяСтрока.НомерСтроки;
				КоличествоСопоставлено   = СтрокаТТН.Количество;
			КонецЕсли;
			
			Если КоличествоСопоставлено < СтрокаТТН.Количество Тогда
				ДопСтрока = ТаблицаТТН.Добавить();
				ЗаполнитьЗначенияСвойств(ДопСтрока, СтрокаТТН);
				ДопСтрока.Количество     = СтрокаТТН.Количество-КоличествоСопоставлено;
				СтрокаТТН.Количество     = КоличествоСопоставлено;
				КоличествоСопоставлено   = СтрокаТТН.Количество;
			КонецЕсли;
			
			СтрокаТТН.Сопоставлена = Истина;
			
			ТекущаяСтрока.ИдентификаторСтроки  = СтрокаТТН.ИдентификаторСтроки;
			ТекущаяСтрока.АлкогольнаяПродукция = СтрокаТТН.АлкогольнаяПродукция;
			ТекущаяСтрока.Сопоставлена = Истина;
			
			КоличествоСопоставлено = КоличествоСопоставлено - СтрокаТТН.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьСтроки()
	
	Для Каждого ТекущаяСтрока Из ТаблицаТоваров Цикл
		СопоставитьСтроку(ТекущаяСтрока);
	КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСопоставить(Команда)
	
	СопоставитьСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикуВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ЗаказыПоставщикуПометка" Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные = Элементы.ЗаказыПоставщику.ТекущиеДанные;
	ПоказатьЗначение(,ТекущиеДанные.ЗаказПоставщику);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровКоличествоПоНакладнойПриИзменении(Элемент)
	
	//ТекущиеДанные = Элементы.ТаблицаТоваров.ТекущиеДанные;
	//
	//Если ТекущиеДанные.Количество = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	////Если ТекущиеДанные.КоличествоПоНакладной = 0 ИЛИ ТекущиеДанные.Количество = 0 Тогда
	////	ТекущиеДанные.КоэффициентАлкогольнойПродукции = 0;
	////	Возврат;
	////КонецЕсли;
	//
	//ТекущиеДанные.КоэффициентАлкогольнойПродукции = ТекущиеДанные.Количество/ТекущиеДанные.КоличествоПоНакладной;
	//
КонецПроцедуры

#КонецОбласти
